app/controllers/articles_controller.rb

  def create
    # @article = Article.new
    # @article.title = params[:title]
    # @article.description = params[:description]
    # @article.save
    @article = Article.create(article_params)
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2019-11-08 19:50:54.624221"], ["updated_at", "2019-11-08 19:50:54.624221"]]

  def update
    # @article = Article.find(params[:id])
    # @article.update(article_params)
    # redirect_to @article
    @article = Article.find(params[:id])
  @article.update(title: params[:article][:title], description: params[:article][:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-11-08 20:13:59.477960"], ["id", 1]]